iPig/src/Reports/АнализСтадаПоПородам/АнализСтадаПоПородам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализСтадаПоПородам</name>
</mdclass:Report>

iPig/src/InformationRegisters/ЖурналОпороса/ЖурналОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОпороса</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Живорожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мертвые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Слаборожденные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Муммии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Свинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереведеноПоросят</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСосков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоОтец</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDГнезда</name>
    <type>
      <types>CatalogRef.IDГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпорос</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Место</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОсеменения/ЖурналОсеменения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОсеменения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОпоросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УшнойВыщип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаАбортаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк1</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПородыХряк2</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПородыОпороса</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазваниеПричины</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк1</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотногоХряк2</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОценкаСлучки</name>
    <type>
      <types>EnumRef.ОценкаСлучки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Работник</name>
    <type>
      <types>CatalogRef.Работник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/ЖурналОтъема/ЖурналОтъема.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтъема</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоОтъемышей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СреднийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозрастПриПодсадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаШпика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодМеста</name>
    <type>
      <types>CatalogRef.Место</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/Аборт/Аборт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Аборт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Мачеха</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КарточкаВнесенияДанных/КарточкаВнесенияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КарточкаВнесенияДанных</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>МассаВвод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МассаВыбытие</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаВыбытие</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыбытие</name>
    <type>
      <types>CatalogRef.Причины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыбытие</name>
    <type>
      <types>EnumRef.ТипВыбытие</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЖивотного</name>
    <type>
      <types>EnumRef.ТипЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПороды</name>
    <type>
      <types>CatalogRef.Порода</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDНомер</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УшнойВыщип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГнезда</name>
    <type>
      <types>CatalogRef.НомерГнезда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиОтец</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РодителиМать</name>
    <type>
      <types>CatalogRef.КарточкаРодители</types>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DGTagId</name>
    <type>
      <types>CatalogRef.IDНомер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/InformationRegisters/КлючевыеЦифрыОпороса/КлючевыеЦифрыОпороса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлючевыеЦифрыОпороса</name>
  <dimensions>
    <name>НомерЖивотного</name>
    <type>
      <types>CatalogRef.НомерЖивотного</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВвода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОпороса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОпороса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДниСупоросности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтъема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодсосныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПотеряноКормодней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаАборта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСлучки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВозрастОтъема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iPig/src/Reports/АнализСтадаПоПородам/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры                   

&НаСервере
Процедура СформироватьОтчетНаСервере() 
	ТабДок.Очистить();
	ТабДок.РазмерСтраницы  = "A4";   
	МассивОпоросов 	= Новый Массив;
	МассивСлучек	= Новый Массив; 
	СуммаОпросов	= 0;
	СуммаСлучек 	= 0;
	Макет = Отчеты.АнализСтадаПоПородам.ПолучитьМакет("АнализСтада"); 
	ОбластьШапкаОтчета = Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьШапкаГруппа = Макет.ПолучитьОбласть("Группа|Шапка");
	ОбластьШапкаОпорос = Макет.ПолучитьОбласть("Опорос|Шапка");
	ОбластьШапкаОтъем  = Макет.ПолучитьОбласть("Отъем|Шапка");  
	ОбластьШапкаВоспроизводство  = Макет.ПолучитьОбласть("Воспроизводство|Шапка");
	ОбластьШапкаРезультат		 = Макет.ПолучитьОбласть("Результат|Шапка");
	ОбластьШапкаПроизводство	 = Макет.ПолучитьОбласть("Производство|Шапка");
	
	
	
	ОбластьШапкаГруппаДанные = Макет.ПолучитьОбласть("Группа|Данные");
	ОбластьГруппаИтого = Макет.ПолучитьОбласть("Группа|Итого");
	
	ОбластьШапкаОтчета.Параметры.Организация  = Константы.Организация.Получить();
	ОбластьШапкаОтчета.Параметры.ПериодОтчета = Период;
	ТабДок.Вывести(ОбластьШапкаОтчета);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЖурналОпороса.КодПороды КАК КодПороды
	               |ПОМЕСТИТЬ ВТДанные
	               |ИЗ
	               |	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
	               |ГДЕ
	               |	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЖурналОсеменения.КодПороды
	               |ИЗ
	               |	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
	               |ГДЕ
	               |	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТДанные.КодПороды КАК КодПороды
	               |ИЗ
	               |	ВТДанные КАК ВТДанные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТДанные.КодПороды";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапросаПороды = Запрос.Выполнить().Выбрать();
	МаксНомерОпороса = 0; 
	ТабДок.Вывести(ОбластьШапкаГруппа);

	Пока РезультатЗапросаПороды.Следующий() Цикл
		ОбластьШапкаГруппаДанные.Параметры.НомерОпороса = РезультатЗапросаПороды.КодПороды;
		ТабДок.Присоединить(ОбластьШапкаГруппаДанные);  
	КонецЦикла;  
	ТабДок.Присоединить(ОбластьГруппаИтого);
	
	#Область Воспроизводство
	//НомерОпороса = 1;
	ТабДок.Вывести(ОбластьШапкаВоспроизводство);    
	ТЗДанные = Новый ТаблицаЗначений;
	ТЗДанные.Колонки.Добавить("КоличествоОсеменений");
	ТЗДанные.Колонки.Добавить("ДнейОтОтъема");
	ТЗДанные.Колонки.Добавить("СвиноматкиОтОтъема");  
	ТЗДанные.Колонки.Добавить("ПовторныхОсеменений"); 
	ТЗДанные.Колонки.Добавить("Абортов");  
	ТЗДанные.Колонки.Добавить("ВозрастРем");
	ТЗДанные.Колонки.Добавить("ОсемененоПосле7Дней"); 
	РезультатЗапросаПороды.Сбросить();
	Пока РезультатЗапросаПороды.Следующий() Цикл	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
		               |	ЖурналОсеменения.ДатаВвода КАК ДатаВвода,
		               |	ЖурналОсеменения.Период КАК Период,
		               |	ЖурналОсеменения.КодПороды КАК КодПороды,
		               |	ЖурналОсеменения.НомерОпороса КАК НомерОпороса
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |ГДЕ
		               |	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(ВТДанные.НомерЖивотного) КАК КоличествоОсеменений,
		               |	ВТДанные.КодПороды КАК КодПороды
		               |ПОМЕСТИТЬ ВТРезультатКоличество
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТДанные.КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЖурналОтъема.Период КАК Период,
		               |	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		               |	ЖурналОтъема.ДатаВвода КАК ДатаВвода,
		               |	ВТДанные.КодПороды КАК КодПороды,
		               |	ЖурналОтъема.НомерОпороса КАК НомерОпороса
		               |ПОМЕСТИТЬ ВТОтъем
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		               |		ПО ВТДанные.НомерЖивотного = ЖурналОтъема.НомерЖивотного
		               |			И ВТДанные.ДатаВвода = ЖурналОтъема.ДатаВвода
		               |ГДЕ
		               |	ЖурналОтъема.Мачеха = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МИНИМУМ(ЖурналОсеменения.Период) КАК Период,
		               |	ЖурналОсеменения.НомерЖивотного КАК НомерЖивотного,
		               |	ЖурналОсеменения.ДатаВвода КАК ДатаВвода,
		               |	ВТДанные.КодПороды КАК КодПороды,
		               |	ЖурналОсеменения.НомерОпороса КАК НомерОпороса
		               |ПОМЕСТИТЬ ВТОсемение
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО ВТДанные.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И ВТДанные.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	ЖурналОсеменения.КодПороды = &КодПороды
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЖурналОсеменения.НомерЖивотного,
		               |	ЖурналОсеменения.ДатаВвода,
		               |	ВТДанные.КодПороды,
		               |	ЖурналОсеменения.НомерОпороса
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	1 КАК Счетчик,
		               |	ВТОсемение.Период КАК Период,
		               |	ВТОсемение.ДатаВвода КАК ДатаВвода,
		               |	ВТОсемение.НомерЖивотного КАК НомерЖивотного,
		               |	ВТОсемение.КодПороды КАК КодПороды,
		               |	ВТОсемение.НомерОпороса КАК НомерОпороса
		               |ПОМЕСТИТЬ ВТОсеменениеФильтр
		               |ИЗ
		               |	ВТОсемение КАК ВТОсемение
		               |ГДЕ
		               |	ВТОсемение.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТОсеменениеФильтр.НомерЖивотного) КАК НомерЖивотного,
		               |	ВТОсеменениеФильтр.КодПороды КАК КодПороды
		               |ПОМЕСТИТЬ ВТСвиноматок
		               |ИЗ
		               |	ВТОсеменениеФильтр КАК ВТОсеменениеФильтр
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТОсеменениеФильтр.КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ОКР(СУММА(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) / ВТСвиноматок.НомерЖивотного, 2) КАК ДнейДо1Осеменения,
		               |	СУММА(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) КАК ДнейОтОтъема,
		               |	ВТСвиноматок.КодПороды КАК КодПороды,
		               |	ВТСвиноматок.НомерЖивотного КАК СвиноматкиОтОтъема
		               |ПОМЕСТИТЬ ВТДнейДоОсеменения
		               |ИЗ
		               |	ВТОтъем КАК ВТОтъем
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсеменениеФильтр КАК ВТОсемение
		               |		ПО (ВТОсемение.НомерЖивотного = ВТОтъем.НомерЖивотного)
		               |			И (ВТОсемение.ДатаВвода = ВТОтъем.ДатаВвода)
		               |			И (ВТОсемение.НомерОпороса = ВТОтъем.НомерОпороса + 1),
		               |	ВТСвиноматок КАК ВТСвиноматок
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТСвиноматок.КодПороды,
		               |	ВТСвиноматок.НомерЖивотного
		               |
		               |ИМЕЮЩИЕ
		               |	ОКР(СУММА(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) / ВТСвиноматок.НомерЖивотного, 2) > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРезультатКоличество.КоличествоОсеменений КАК КоличествоОсеменений,
		               |	ВТДнейДоОсеменения.ДнейДо1Осеменения КАК ДнейДо1Осеменения,
		               |	ВТДнейДоОсеменения.ДнейОтОтъема КАК ДнейОтОтъема,
		               |	ВТДнейДоОсеменения.СвиноматкиОтОтъема КАК СвиноматкиОтОтъема
		               |ИЗ
		               |	ВТРезультатКоличество КАК ВТРезультатКоличество
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДнейДоОсеменения КАК ВТДнейДоОсеменения
		               |		ПО ВТДнейДоОсеменения.КодПороды = ВТРезультатКоличество.КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(ЖурналОсеменения.Период) КАК ПовторныхОсеменений,
		               |	КОЛИЧЕСТВО(ВТДанные.НомерЖивотного) КАК НомерЖивотного
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО ВТДанные.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И ВТДанные.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |			И ВТДанные.КодПороды = ЖурналОсеменения.КодПороды
		               |			И ВТДанные.НомерОпороса = ЖурналОсеменения.НомерОпороса
		               |ГДЕ
		               |	ВТДанные.Период > ЖурналОсеменения.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЖурналОсеменения.КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(Аборт.Период) КАК Абортов,
		               |	КОЛИЧЕСТВО(Аборт.НомерЖивотного) КАК НомерЖивотного,
		               |	Аборт.КодПороды КАК КодПороды
		               |ИЗ
		               |	РегистрСведений.Аборт КАК Аборт
		               |ГДЕ
		               |	Аборт.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И Аборт.КодПороды = &КодПороды
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Аборт.КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ЖурналОсеменения.НомерОпороса = 1
		               |			ТОГДА ОКР(СУММА(ВЫБОР
		               |							КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КарточкаВнесенияДанных.ДатаРождения, ДЕНЬ), НАЧАЛОПЕРИОДА(ЖурналОсеменения.Период, ДЕНЬ), ДЕНЬ) < 365
		               |								ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КарточкаВнесенияДанных.ДатаРождения, ДЕНЬ), НАЧАЛОПЕРИОДА(ЖурналОсеменения.Период, ДЕНЬ), ДЕНЬ)
		               |							ИНАЧЕ 365
		               |						КОНЕЦ) / КОЛИЧЕСТВО(ЖурналОсеменения.НомерЖивотного), 2)
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК ВозрастРем,
		               |	КарточкаВнесенияДанных.КодПороды КАК КодПороды
		               |ИЗ
		               |	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
		               |		ПО ЖурналОсеменения.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
		               |			И ЖурналОсеменения.ДатаВвода = КарточкаВнесенияДанных.Период
		               |ГДЕ
		               |	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |	И ЖурналОсеменения.НомерОпороса = 1
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	КарточкаВнесенияДанных.КодПороды,
		               |	ЖурналОсеменения.НомерОпороса
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТОсеменениеФильтр.Счетчик) КАК Счетчик
		               |ПОМЕСТИТЬ ВТОсеменДо1Случки
		               |ИЗ
		               |	ВТОсеменениеФильтр КАК ВТОсеменениеФильтр
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТОсеменДо1Случки.Счетчик - КОЛИЧЕСТВО(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ)) КАК ОсемененоПосле7Дней
		               |ИЗ
		               |	ВТОтъем КАК ВТОтъем
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсеменениеФильтр КАК ВТОсемение
		               |		ПО (ВТОсемение.КодПороды = ВТОтъем.КодПороды)
		               |			И (ВТОсемение.НомерЖивотного = ВТОтъем.НомерЖивотного)
		               |			И (ВТОсемение.ДатаВвода = ВТОтъем.ДатаВвода),
		               |	ВТОсеменДо1Случки КАК ВТОсеменДо1Случки
		               |ГДЕ
		               |	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ВТОтъем.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ВТОсемение.Период, ДЕНЬ), ДЕНЬ) <= 7
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТОсеменДо1Случки.Счетчик"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет();  
		ОбластьШапкаВоспроизводствоДанные  = Макет.ПолучитьОбласть("Воспроизводство|Данные");   
		НоваяСтрока = ТЗДанные.Добавить();
		РезультатЗапроса = РезультатЗапросаПакет[7].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла; 	
		РезультатЗапроса = РезультатЗапросаПакет[8].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса);
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла; 
		РезультатЗапроса = РезультатЗапросаПакет[9].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[10].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла;    
		РезультатЗапроса = РезультатЗапросаПакет[12].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаВоспроизводствоДанные.Параметры.Заполнить(РезультатЗапроса);  
			ЗаполнитьЗначенияСвойств(НоваяСтрока,РезультатЗапроса);	
		КонецЦикла;   
		МассивСлучек.Добавить(?(ЗначениеЗаполнено(ОбластьШапкаВоспроизводствоДанные.Параметры.КоличествоОсеменений),ОбластьШапкаВоспроизводствоДанные.Параметры.КоличествоОсеменений,0));
		ТабДок.Присоединить(ОбластьШапкаВоспроизводствоДанные);
//		НомерОпороса = НомерОпороса + 1;
	КонецЦикла;	
		
	
	ОбластьВоспроизводствоИтого  = Макет.ПолучитьОбласть("Воспроизводство|Итого");
	ОбластьВоспроизводствоИтого.Параметры.КоличествоОсеменений = ТЗДанные.Итог("КоличествоОсеменений");    
	Если ТЗДанные.Итог("СвиноматкиОтОтъема") > 0 Тогда
//		ОбластьВоспроизводствоИтого.Параметры.ДнейДо1Осеменения = Окр(ТЗДанные.Итог("ДнейОтОтъема")/ТЗДанные.Итог("СвиноматкиОтОтъема"),2);  
	КонецЕсли;
	ОбластьВоспроизводствоИтого.Параметры.ПовторныхОсеменений = ТЗДанные.Итог("ПовторныхОсеменений");
	ОбластьВоспроизводствоИтого.Параметры.Абортов = ТЗДанные.Итог("Абортов");   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЖурналОсеменения.НомерОпороса = 1
	               |			ТОГДА ОКР(СУММА(ВЫБОР
	               |							КОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КарточкаВнесенияДанных.ДатаРождения, ДЕНЬ), НАЧАЛОПЕРИОДА(ЖурналОсеменения.Период, ДЕНЬ), ДЕНЬ) < 365
	               |								ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(КарточкаВнесенияДанных.ДатаРождения, ДЕНЬ), НАЧАЛОПЕРИОДА(ЖурналОсеменения.Период, ДЕНЬ), ДЕНЬ)
	               |							ИНАЧЕ 365
	               |						КОНЕЦ) / КОЛИЧЕСТВО(ЖурналОсеменения.НомерЖивотного), 2)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВозрастРем
	               |ИЗ
	               |	РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КарточкаВнесенияДанных КАК КарточкаВнесенияДанных
	               |		ПО ЖурналОсеменения.НомерЖивотного = КарточкаВнесенияДанных.НомерЖивотного
	               |			И ЖурналОсеменения.ДатаВвода = КарточкаВнесенияДанных.Период
	               |ГДЕ
	               |	ЖурналОсеменения.Период МЕЖДУ &ДатаНач И &ДатаКон
	               |	И ЖурналОсеменения.НомерОпороса = 1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЖурналОсеменения.НомерОпороса"; 
	
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
   	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрЗапрос Из РезультатЗапроса Цикл
		ОбластьВоспроизводствоИтого.Параметры.ВозрастРем = СтрЗапрос.ВозрастРем;  
	КонецЦикла;
//	ОбластьВоспроизводствоИтого.Параметры.ОсемененоПосле7Дней = ТЗДанные.Итог("ОсемененоПосле7Дней");
	
	
	ТабДок.Присоединить(ОбластьВоспроизводствоИтого);
	#КонецОбласти
	
	
	#Область Опорос

	ТабДок.Вывести(ОбластьШапкаОпорос);
	РезультатЗапросаПороды.Сбросить();
	Пока РезультатЗапросаПороды.Следующий() Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	ЖурналОпороса.Живорожденные КАК Живорожденные,
		               |	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
		               |	ЖурналОпороса.Муммии + ЖурналОпороса.Мертвые КАК Мертворожденные,
		               |	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		               |	ЖурналОпороса.Муммии КАК Муммии
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		               |ГДЕ
		               |	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОпороса.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
		               |	СУММА(ВТДанные.Слаборожденные) КАК Слаборожденные,
		               |	СУММА(ВТДанные.Мертворожденные) КАК Мертворожденные,
		               |	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи,
		               |	СУММА(ВТДанные.Муммии) КАК Муммии
		               |ПОМЕСТИТЬ ВТРасчет
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
		               |	ВТРасчет.Живорожденные КАК ЖиворожденныеВсего,
		               |	ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2) КАК ЖиворожденныеНаОпорос,
		               |	ВТРасчет.Мертворожденные КАК МертворожденныеВсего,
		               |	ОКР(ВТРасчет.Мертворожденные / ВТРасчет.НомерЗаписи, 2) КАК МертворожденныеНаОпорос,
		               |	ВТРасчет.Слаборожденные КАК СлаборожденныеВсего,
		               |	ОКР(ВТРасчет.Слаборожденные / ВТРасчет.НомерЗаписи, 2) КАК СлаборожденныеНаОпорос,
		               |	ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные КАК ВсегоРожденныхЗаПериод,
		               |	ОКР((ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные) / ВТРасчет.НомерЗаписи, 2) КАК ВсегоРожденныхНаОпорос,
		               |	ОКР(ВТРасчет.Муммии / ВТРасчет.НомерЗаписи, 2) КАК МуммииНаОпорос
		               |ИЗ
		               |	ВТРасчет КАК ВТРасчет"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		ОбластьШапкаОпоросДанные = Макет.ПолучитьОбласть("Опорос|Данные");
		Пока РезультатЗапроса.Следующий() Цикл  
			ОбластьШапкаОпоросДанные.Параметры.Заполнить(РезультатЗапроса);	 
		КонецЦикла; 	
		МассивОпоросов.Добавить(?(ЗначениеЗаполнено(ОбластьШапкаОпоросДанные.Параметры.КоличествоОпоросов),ОбластьШапкаОпоросДанные.Параметры.КоличествоОпоросов,0));
		ТабДок.Присоединить(ОбластьШапкаОпоросДанные); 
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
	|	ЖурналОпороса.Живорожденные КАК Живорожденные,
	|	ЖурналОпороса.Слаборожденные КАК Слаборожденные,
	|	ЖурналОпороса.Муммии + ЖурналОпороса.Мертвые КАК Мертворожденные,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	|	ЖурналОпороса.Муммии КАК Муммии
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
	|ГДЕ
	|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
	|	СУММА(ВТДанные.Слаборожденные) КАК Слаборожденные,
	|	СУММА(ВТДанные.Мертворожденные) КАК Мертворожденные,
	|	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи,
	|	СУММА(ВТДанные.Муммии) КАК Муммии
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
	|	ВТРасчет.Живорожденные КАК ЖиворожденныеВсего,
	|	ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2) КАК ЖиворожденныеНаОпорос,
	|	ВТРасчет.Мертворожденные КАК МертворожденныеВсего,
	|	ОКР(ВТРасчет.Мертворожденные / ВТРасчет.НомерЗаписи, 2) КАК МертворожденныеНаОпорос,
	|	ВТРасчет.Слаборожденные КАК СлаборожденныеВсего,
	|	ОКР(ВТРасчет.Слаборожденные / ВТРасчет.НомерЗаписи, 2) КАК СлаборожденныеНаОпорос,
	|	ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные КАК ВсегоРожденныхЗаПериод,
	|	ОКР((ВТРасчет.Живорожденные + ВТРасчет.Мертворожденные) / ВТРасчет.НомерЗаписи, 2) КАК ВсегоРожденныхНаОпорос,
	|	ОКР(ВТРасчет.Муммии / ВТРасчет.НомерЗаписи, 2) КАК МуммииНаОпорос
	|ИЗ
	|	ВТРасчет КАК ВТРасчет"; 
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
	ОбластьОпоросИтого = Макет.ПолучитьОбласть("Опорос|Итого"); 
	Пока РезультатЗапроса.Следующий() Цикл  
		ОбластьОпоросИтого.Параметры.Заполнить(РезультатЗапроса);	 
	КонецЦикла;	
	ТабДок.Присоединить(ОбластьОпоросИтого);
	#КонецОбласти 
	
	#Область Производство 
	ТабДок.Вывести(ОбластьШапкаПроизводство);
	РезультатЗапросаПороды.Сбросить();   
	НомерОпороса = 0;
	Пока РезультатЗапросаПороды.Следующий() Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	ЖурналОпороса.Живорожденные КАК Живорожденные,
		               |	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		               |ГДЕ
		               |	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОпороса.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
		               |	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи
		               |ПОМЕСТИТЬ ВТРасчет
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
		               |	ЕСТЬNULL(ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2), 0) КАК ЖиворожденныеНаОпорос
		               |ИЗ
		               |	ВТРасчет КАК ВТРасчет"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		ОбластьШапкаПроизводствоДанные = Макет.ПолучитьОбласть("Производство|Данные");
		ЖиворожденныеНаОпорос = 0;
		Пока РезультатЗапроса.Следующий() Цикл  
			ЖиворожденныеНаОпорос = РезультатЗапроса.ЖиворожденныеНаОпорос;	 
		КонецЦикла;    
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
		               |	ЖурналОтъема.МассаВсего КАК МассаВсего,
		               |	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		               |	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов,
		               |	ЖурналОсеменения.КодПороды КАК КодПороды
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО ЖурналОтъема.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И ЖурналОтъема.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
		               |	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
		               |	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов
		               |ПОМЕСТИТЬ ВТРасчет
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
		               |	ВТРасчет.МассаВсего КАК ВесОтъема,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОтъемышей = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1)
		               |	КОНЕЦ КАК ВесОтъемаПоросят,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОтъемов = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ЕСТЬNULL(ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1), 0)
		               |	КОНЕЦ КАК ОтнятоНаОтъем
		               |ИЗ
		               |	ВТРасчет КАК ВТРасчет";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		Пока РезультатЗапроса.Следующий() Цикл 		
			ОтнятыхНаОпорос = РезультатЗапроса.ОтнятоНаОтъем;;			
		КонецЦикла;                                     
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни
		               |ПОМЕСТИТЬ ВТПодсос
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО КлючевыеЦифрыОпороса.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И КлючевыеЦифрыОпороса.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
		               |ПОМЕСТИТЬ ВТСупоросность
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО КлючевыеЦифрыОпороса.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И КлючевыеЦифрыОпороса.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормодней
		               |ПОМЕСТИТЬ ВТПотеряноДней
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО КлючевыеЦифрыОпороса.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И КлючевыеЦифрыОпороса.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
		               |				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
		               |	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
		               |ИЗ
		               |	ВТСупоросность КАК ВТСупоросность
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
		               |	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов
		               |ИЗ
		               |	ВТПодсос КАК ВТПодсос
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормодней), 0) КАК ПотеряноКормодней
		               |ИЗ
		               |	ВТПотеряноДней КАК ВТПотеряноДней";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
		
		ПродуктивныеДни = 0;
		НепродуктивныеДни = 0;
		ПроизведеноОпоросов = 0;
		
		РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
			Иначе
				СупоросныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;
			Иначе 
				ПодсосныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;     
		Если СупоросныхДнейНаОпорос > 0 И ПодсосныхДнейНаОпорос > 0 Тогда
			ПроизведеноОпоросов = ПродуктивныеДни / (СупоросныхДнейНаОпорос + ПодсосныхДнейНаОпорос);  
		КонецЕсли;
		РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	  
			НепродуктивныеДни = РезультатЗапроса.ПотеряноКормодней; 
			Если ПроизведеноОпоросов > 0  Тогда
				ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,0) ;		
			КонецЕсли;
		КонецЦикла;  
		Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
			ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
			ОбластьШапкаПроизводствоДанные.Параметры.ЖиворожденныхНаСвиноматкуВГод = ОКР(ЖиворожденныеНаОпорос * ОпоросовНаСвиноматкуВГод,2);   
			ОбластьШапкаПроизводствоДанные.Параметры.ОтнятоПоросятНаСвиноматкуВГод = ОКР(ОтнятыхНаОпорос * ОпоросовНаСвиноматкуВГод,2); 
		КонецЕсли;	
		
		НомерОпороса = НомерОпороса + 1;
		Если МассивСлучек[НомерОпороса - 1] > 0 Тогда  
			СуммаОпросов 	= СуммаОпросов + МассивОпоросов[НомерОпороса - 1];
			СуммаСлучек 	= СуммаСлучек +  МассивСлучек[НомерОпороса - 1];	
			ОбластьШапкаПроизводствоДанные.Параметры.ПроцентОпороса = ОКР(МассивОпоросов[НомерОпороса - 1] * 100 / МассивСлучек[НомерОпороса - 1],2);
		КонецЕсли;

		
		ТабДок.Присоединить(ОбластьШапкаПроизводствоДанные); 
	КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЖурналОпороса.НомерЖивотного КАК НомерЖивотного,
		|	ЖурналОпороса.Живорожденные КАК Живорожденные,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрСведений.ЖурналОпороса КАК ЖурналОпороса
		|ГДЕ
		|	ЖурналОпороса.Период МЕЖДУ &ДатаНач И &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТДанные.Живорожденные) КАК Живорожденные,
		|	МАКСИМУМ(ВТДанные.НомерЗаписи) КАК НомерЗаписи
		|ПОМЕСТИТЬ ВТРасчет
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРасчет.НомерЗаписи КАК КоличествоОпоросов,
		|	ЕСТЬNULL(ОКР(ВТРасчет.Живорожденные / ВТРасчет.НомерЗаписи, 2), 0) КАК ЖиворожденныеНаОпорос
		|ИЗ
		|	ВТРасчет КАК ВТРасчет"; 
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();      
		ОбластьПроизводствоИтого = Макет.ПолучитьОбласть("Производство|Итого"); 
		ЖиворожденныеНаОпорос = 0;
		Пока РезультатЗапроса.Следующий() Цикл  
			ЖиворожденныеНаОпорос = РезультатЗапроса.ЖиворожденныеНаОпорос;	 
		КонецЦикла;    
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
		|	ЖурналОтъема.МассаВсего КАК МассаВсего,
		|	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		|	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
		|ПОМЕСТИТЬ ВТДанные
		|ИЗ
		|	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		|ГДЕ
		|	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
		|	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
		|	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов
		|ПОМЕСТИТЬ ВТРасчет
		|ИЗ
		|	ВТДанные КАК ВТДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
		|	ВТРасчет.МассаВсего КАК ВесОтъема,
		|	ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1) КАК ВесОтъемаПоросят,
		|	ЕСТЬNULL(ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1),0) КАК ОтнятоНаОтъем
		|ИЗ
		|	ВТРасчет КАК ВТРасчет";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		Пока РезультатЗапроса.Следующий() Цикл 		
			ОтнятыхНаОпорос = РезультатЗапроса.ОтнятоНаОтъем;;			
		КонецЦикла;                                     
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни
		|ПОМЕСТИТЬ ВТПодсос
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
		|ПОМЕСТИТЬ ВТСупоросность
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	КлючевыеЦифрыОпороса.ДатаОпороса МЕЖДУ &ДатаНач И &ДатаКон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		|	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		|	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормодней
		|ПОМЕСТИТЬ ВТПотеряноДней
		|ИЗ
		|	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		|ГДЕ
		|	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
		|				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		|			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
		|	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
		|ИЗ
		|	ВТСупоросность КАК ВТСупоросность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
		|	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов
		|ИЗ
		|	ВТПодсос КАК ВТПодсос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТПотеряноДней.ПотеряноКормодней) КАК ПотеряноКормодней
		|ИЗ
		|	ВТПотеряноДней КАК ВТПотеряноДней";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
		
		ПродуктивныеДни = 0;
		НепродуктивныеДни = 0;
		ПроизведеноОпоросов = 0;
		
		РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
			Иначе
				СупоросныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;
			Иначе 
				ПодсосныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;     
		Если СупоросныхДнейНаОпорос > 0 И ПодсосныхДнейНаОпорос > 0 Тогда
			ПроизведеноОпоросов = ПродуктивныеДни / (СупоросныхДнейНаОпорос + ПодсосныхДнейНаОпорос);  
		КонецЕсли;
		РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	  
			НепродуктивныеДни = РезультатЗапроса.ПотеряноКормодней; 
			Если ПроизведеноОпоросов > 0  Тогда
				ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,0) ;		
			КонецЕсли;
		КонецЦикла;  
		Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
			ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
			ОбластьПроизводствоИтого.Параметры.ЖиворожденныхНаСвиноматкуВГод = ОКР(ЖиворожденныеНаОпорос * ОпоросовНаСвиноматкуВГод,2);   
			ОбластьПроизводствоИтого.Параметры.ОтнятоПоросятНаСвиноматкуВГод = ОКР(ОтнятыхНаОпорос * ОпоросовНаСвиноматкуВГод,2); 
		КонецЕсли;	
		
		Если СуммаСлучек > 0 Тогда  
				
			ОбластьПроизводствоИтого.Параметры.ПроцентОпороса = ОКР(СуммаОпросов * 100 / СуммаСлучек,2);
		КонецЕсли;
		ТабДок.Присоединить(ОбластьПроизводствоИтого);
	
	#КонецОбласти
	
	#Область Отъем
	ТабДок.Вывести(ОбластьШапкаОтъем);
	РезультатЗапросаПороды.Сбросить();
	Пока РезультатЗапросаПороды.Следующий() Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
		               |	ЖурналОтъема.МассаВсего КАК МассаВсего,
		               |	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
		               |	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
		               |ПОМЕСТИТЬ ВТДанные
		               |ИЗ
		               |	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО ЖурналОтъема.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И ЖурналОтъема.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
		               |	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
		               |	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов
		               |ПОМЕСТИТЬ ВТРасчет
		               |ИЗ
		               |	ВТДанные КАК ВТДанные
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
		               |	ВТРасчет.МассаВсего КАК ВесОтъема,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОтъемышей = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1)
		               |	КОНЕЦ КАК ВесОтъемаПоросят,
		               |	ВЫБОР
		               |		КОГДА ВТРасчет.КоличествоОтъемов = 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1)
		               |	КОНЕЦ КАК ОтнятоНаОтъем,
		               |	ВТРасчет.КоличествоОтъемов КАК КоличествоОтъемов
		               |ИЗ
		               |	ВТРасчет КАК ВТРасчет";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		ОбластьШапкаОтъемДанные  = Макет.ПолучитьОбласть("Отъем|Данные");
		Пока РезультатЗапроса.Следующий() Цикл 		
			ОбластьШапкаОтъемДанные.Параметры.Заполнить(РезультатЗапроса);			
		КонецЦикла;                                                       
		ТабДок.Присоединить(ОбластьШапкаОтъемДанные); 
	КонецЦикла;
	
	ОбластьОтъемИтого  = Макет.ПолучитьОбласть("Отъем|Итого");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЖурналОтъема.КоличествоОтъемышей КАК КоличествоОтъемышей,
	|	ЖурналОтъема.МассаВсего КАК МассаВсего,
	|	ЖурналОтъема.НомерЖивотного КАК НомерЖивотного,
	|	АВТОНОМЕРЗАПИСИ() КАК КоличествоОтъемов
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.ЖурналОтъема КАК ЖурналОтъема
	|ГДЕ
	|	ЖурналОтъема.Период МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТДанные.КоличествоОтъемышей) КАК КоличествоОтъемышей,
	|	СУММА(ВТДанные.МассаВсего) КАК МассаВсего,
	|	МАКСИМУМ(ВТДанные.КоличествоОтъемов) КАК КоличествоОтъемов
	|ПОМЕСТИТЬ ВТРасчет
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасчет.КоличествоОтъемышей КАК ОтнятыхПоросят,
	|	ВТРасчет.МассаВсего КАК ВесОтъема,
	|	ОКР(ВТРасчет.МассаВсего / ВТРасчет.КоличествоОтъемышей, 1) КАК ВесОтъемаПоросят,
	|	ОКР(ВТРасчет.КоличествоОтъемышей / ВТРасчет.КоличествоОтъемов, 1) КАК ОтнятоНаОтъем,
	|	ВТРасчет.КоличествоОтъемов КАК КоличествоОтъемов
	|ИЗ
	|	ВТРасчет КАК ВТРасчет";
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
	ОбластьОтъемИтого  = Макет.ПолучитьОбласть("Отъем|Итого");
	Пока РезультатЗапроса.Следующий() Цикл 		
		ОбластьОтъемИтого.Параметры.Заполнить(РезультатЗапроса);			
	КонецЦикла; 	
	ТабДок.Присоединить(ОбластьОтъемИтого);	
	
	#КонецОбласти
	
	#Область Результат
	ТабДок.Вывести(ОбластьШапкаРезультат);
	РезультатЗапросаПороды.Сбросить();
	Пока РезультатЗапросаПороды.Следующий() Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни
		               |ПОМЕСТИТЬ ВТПодсос
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО КлючевыеЦифрыОпороса.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И КлючевыеЦифрыОпороса.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
		               |ПОМЕСТИТЬ ВТСупоросность
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО КлючевыеЦифрыОпороса.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И КлючевыеЦифрыОпороса.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормодней
		               |ПОМЕСТИТЬ ВТПотеряноДней
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОсеменения КАК ЖурналОсеменения
		               |		ПО КлючевыеЦифрыОпороса.НомерЖивотного = ЖурналОсеменения.НомерЖивотного
		               |			И КлючевыеЦифрыОпороса.ДатаВвода = ЖурналОсеменения.ДатаВвода
		               |ГДЕ
		               |	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
		               |				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
		               |	И ЖурналОсеменения.КодПороды = &КодПороды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
		               |	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
		               |ИЗ
		               |	ВТСупоросность КАК ВТСупоросность
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
		               |	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов
		               |ИЗ
		               |	ВТПодсос КАК ВТПодсос
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТПотеряноДней.ПотеряноКормодней), 0) КАК ПотеряноКормодней
		               |ИЗ
		               |	ВТПотеряноДней КАК ВТПотеряноДней";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		Запрос.УстановитьПараметр("КодПороды",РезультатЗапросаПороды.КодПороды);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
		ОбластьШапкаРезультатДанные  = Макет.ПолучитьОбласть("Результат|Данные");      
		
		ПродуктивныеДни = 0;
		НепродуктивныеДни = 0;
		ПроизведеноОпоросов = 0;
		
		РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
			Иначе
				ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;
			Иначе 
				ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;     
		Если ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос > 0 И ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос > 0 Тогда
			ПроизведеноОпоросов = ПродуктивныеДни / (ОбластьШапкаРезультатДанные.Параметры.СупоросныхДнейНаОпорос + ОбластьШапкаРезультатДанные.Параметры.ПодсосныхДнейНаОпорос);  
		КонецЕсли;
		РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	  
			НепродуктивныеДни = РезультатЗапроса.ПотеряноКормодней; 
			Если ПроизведеноОпоросов > 0  Тогда
				ОбластьШапкаРезультатДанные.Параметры.ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,2) ;		
			КонецЕсли;
		КонецЦикла;  
		Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
			ОбластьШапкаРезультатДанные.Параметры.ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
		КонецЕсли;		
		
		ТабДок.Присоединить(ОбластьШапкаРезультатДанные); 
	
	КонецЦикла; 
	
	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.ПодсосныеДни КАК ПодсосныеДни
		               |ПОМЕСТИТЬ ВТПодсос
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |ГДЕ
		               |	КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДниСупоросности КАК ДниСупоросности
		               |ПОМЕСТИТЬ ВТСупоросность
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |ГДЕ
		               |	КлючевыеЦифрыОпороса.ДатаОпороса МЕЖДУ &ДатаНач И &ДатаКон
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КлючевыеЦифрыОпороса.НомерЖивотного КАК НомерЖивотного,
		               |	КлючевыеЦифрыОпороса.ДатаВвода КАК ДатаВвода,
		               |	КлючевыеЦифрыОпороса.ПотеряноКормодней КАК ПотеряноКормодней
		               |ПОМЕСТИТЬ ВТПотеряноДней
		               |ИЗ
		               |	РегистрСведений.КлючевыеЦифрыОпороса КАК КлючевыеЦифрыОпороса
		               |ГДЕ
		               |	(КлючевыеЦифрыОпороса.ДатаСлучки МЕЖДУ &ДатаНач И &ДатаКон
		               |				И КлючевыеЦифрыОпороса.ДатаОпороса = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ИЛИ КлючевыеЦифрыОпороса.ДатаОтъема МЕЖДУ &ДатаНач И &ДатаКон
		               |			ИЛИ КлючевыеЦифрыОпороса.ДатаАборта МЕЖДУ &ДатаНач И &ДатаКон)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТСупоросность.ДниСупоросности), 0) КАК СупоросныхДней,
		               |	КОЛИЧЕСТВО(ВТСупоросность.НомерЖивотного) КАК Опоросов
		               |ИЗ
		               |	ВТСупоросность КАК ВТСупоросность
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(ВТПодсос.ПодсосныеДни), 0) КАК ПодсосныеДни,
		               |	КОЛИЧЕСТВО(ВТПодсос.НомерЖивотного) КАК Опоросов
		               |ИЗ
		               |	ВТПодсос КАК ВТПодсос
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СУММА(ВТПотеряноДней.ПотеряноКормодней) КАК ПотеряноКормодней
		               |ИЗ
		               |	ВТПотеряноДней КАК ВТПотеряноДней";
		Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
		РезультатЗапросаПакет = Запрос.ВыполнитьПакет(); 
		ОбластьРезультатИтого  = Макет.ПолучитьОбласть("Результат|Итого");      
		
		ПродуктивныеДни = 0;
		НепродуктивныеДни = 0;
		ПроизведеноОпоросов = 0;
		
		РезультатЗапроса = РезультатЗапросаПакет[3].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = РезультатЗапроса.СупоросныхДней;  
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос = Окр(РезультатЗапроса.СупоросныхДней / РезультатЗапроса.Опоросов,0) ;			
			Иначе
				ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;  
		РезультатЗапроса = РезультатЗапросаПакет[4].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	
			ПродуктивныеДни = ПродуктивныеДни + РезультатЗапроса.ПодсосныеДни; 
			Если РезультатЗапроса.Опоросов > 0 Тогда  
				ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос = Окр(РезультатЗапроса.ПодсосныеДни / РезультатЗапроса.Опоросов,0) ;
			Иначе 
				ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос = 0;
			КонецЕсли;
		КонецЦикла;     
		Если ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос > 0 И ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос > 0 Тогда
			ПроизведеноОпоросов = ПродуктивныеДни / (ОбластьРезультатИтого.Параметры.СупоросныхДнейНаОпорос + ОбластьРезультатИтого.Параметры.ПодсосныхДнейНаОпорос);  
		КонецЕсли;
		РезультатЗапроса = РезультатЗапросаПакет[5].Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл 	  
			НепродуктивныеДни = РезультатЗапроса.ПотеряноКормодней; 
			Если ПроизведеноОпоросов > 0  Тогда
				ОбластьРезультатИтого.Параметры.ПустыеДниНаОпорос = Окр(РезультатЗапроса.ПотеряноКормодней / ПроизведеноОпоросов,0) ;		
			КонецЕсли;
		КонецЦикла;  
		Если (ПродуктивныеДни + НепродуктивныеДни) > 0  Тогда
			ОбластьРезультатИтого.Параметры.ОпоросовНаСвиноматкуВГод = ОКР(ПроизведеноОпоросов /((ПродуктивныеДни + НепродуктивныеДни)/365),2);
		КонецЕсли;		
		
		ТабДок.Присоединить(ОбластьРезультатИтого); 

	
	
	#КонецОбласти
	
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры
